Revit 2027 API
GroupTypeId.ElectricalAnalysis Property
 Electrical Analysis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ElectricalAnalysis { get; }
Public Shared ReadOnly Property ElectricalAnalysis As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ElectricalAnalysis {
	ForgeTypeId^ get ();
}
static member ElectricalAnalysis : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace